# SQL Tasks
# Section 1. Relational model

## Section 1.1

**Task 1.** Сформулируйте SQL запрос для создания таблицы book.

**CREATE TABLE book (<br>
    &emsp;book_id INT PRIMARY KEY AUTO_INCREMENT,<br>
    &emsp;title VARCHAR(50),<br>
    &emsp;author VARCHAR(30),<br>
    &emsp;price DECIMAL(8, 2),<br>
    &emsp;amount INT<br>
    &emsp;);**

**Task 2.** Занесите новую строку в таблицу book (текстовые значения (тип VARCHAR) заключать либо в двойные, либо в одинарные кавычки).

**INSERT INTO book(title, author, price, amount)<br>
VALUES ('Кобзар', 'Шевченко Т.Г.', 670.99, 3);<br>
<br>
SELECT * FROM book;**

**Task 3.** Занесите три последние записи в таблицуbook,  первая запись уже добавлена на предыдущем шаге.

**INSERT INTO book(title, author, price, amount)<br>
VALUES ('Зів'яле листя', 'Франко І.Я.', 540.50, 5),<br>
       ('Я (Романтика)', 'Хвильовий М.Г.', 460.00, 10),<br>
       ('Веселий цвинтар', 'Стус В.С.', 799.01, 2);**<br>

**SELECT * FROM book;**

## Section 1.2

**Task 1.** Вывести информацию о всех книгах, хранящихся на складе.

**SELECT * FROM book;**

**Task 2.** Выбрать авторов, название книг и их цену из таблицы book.

**SELECT author, title, price FROM book;**

**Task 3.** Выбрать названия книг и авторов из таблицы book, для поля title задать имя(псевдоним) Название, для поля author –  Автор.

**SELECT title AS Название, author AS Автор<br>
FROM book;**

**Task 4.** Для упаковки каждой книги требуется один лист бумаги, цена которого 1 рубль 65 копеек. Посчитать стоимость упаковки для каждой книги (сколько денег потребуется, чтобы упаковать все экземпляры книги). В запросе вывести название книги, ее количество и стоимость упаковки, последний столбец назвать pack.

**SELECT title, amount, amount * 1.65 AS pack<br>
FROM book;**

**Task 5.** В конце года цену всех книг на складе пересчитывают – снижают ее на 30%. Написать SQL запрос, который из таблицы book выбирает названия, авторов, количества и вычисляет новые цены книг. Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой.


**SELECT title, author, amount,<br>
       &emsp;ROUND(price - (price * 0.3), 2) AS new_price<br>
FROM book;**

**Task 6.** При анализе продаж книг выяснилось, что наибольшей популярностью пользуются книги Тараса Шевченко, на втором месте книги Ивана Франко. Исходя из этого решили поднять цену книг Шевченко на 10%, а цену книг Франко - на 5%. Написать запрос, куда включить автора, название книги и новую цену, последний столбец назвать new_price. Значение округлить до двух знаков после запятой.

**SELECT author, title,<br>
       &emsp;ROUND(IF(author='Шевченко Т.Г.', price\*1.1, IF(author='Франко І.Я.', price\*1.05, price)), 2) AS new_price<br>
FROM book;**

**Task 7.** Вывести автора, название  и цены тех книг, количество которых меньше 10.

**SELECT author, title, price<br>
FROM book<br>
WHERE amount < 10;<br>**

**Task 8.** Вывести название, автора,  цену  и количество всех книг, цена которых меньше 500 или больше 600, а стоимость всех экземпляров этих книг больше или равна 5000.

**SELECT title, author, price, amount<br>
FROM book<br>
WHERE (amount < 500 OR amount > 600) AND (price * amount >= 5000);<br>**

**Task 9.** Вывести название и авторов тех книг, цены которых принадлежат интервалу от 540.50 до 800 (включая границы),  а количество или 2, или 3, или 5, или 7.

**SELECT title, author<br>
FROM book<br>
WHERE (price BETWEEN 540.50 AND 800) AND amount IN (2, 3, 5, 7);<br>**

**Task 10.** Вывести  автора и название  книг, количество которых принадлежит интервалу от 2 до 14 (включая границы). Информацию  отсортировать сначала по авторам (в обратном алфавитном порядке), а затем по названиям книг (по алфавиту).

**SELECT author, title<br>
FROM book<br>
WHERE amount BETWEEN 2 AND 14<br>
ORDER BY 1 DESC, 2;**

**Task 11.** Вывести название и автора тех книг, название которых состоит из двух и более слов, а инициалы автора содержат букву «С». Считать, что в названии слова отделяются друг от друга пробелами и не содержат знаков препинания, между фамилией автора и инициалами обязателен пробел, инициалы записываются без пробела в формате: буква, точка, буква, точка. Информацию отсортировать по названию книги в алфавитном порядке.

**SELECT title, author<br>
FROM book<br>
WHERE (title LIKE '_\% _\%') AND (author LIKE '\%С.\%')<br>
ORDER BY title;**

## Section 1.3

**Task 1.** Отобрать различные (уникальные) элементы столбца amount таблицы book.

**SELECT amount<br>
FROM book<br>
GROUP BY amount;<br>**

**Task 2.** Посчитать, количество различных книг и количество экземпляров книг каждого автора , хранящихся на складе.  Столбцы назвать Автор, Различных_книг и Количество_экземпляров соответственно.

**SELECT author AS Автор, COUNT(amount) AS Различных_книг, SUM(amount) AS Количество_экземпляров<br>
FROM book<br>
GROUP BY author;**

**Task 3.** Вывести фамилию и инициалы автора, минимальную, максимальную и среднюю цену книг каждого автора. Вычисляемые столбцы назвать Минимальная_цена, Максимальная_цена и Средняя_цена соответственно.

**SELECT author,<br>
       &emsp;&emsp;&emsp;&emsp;MIN(price) AS Минимальная_цена,<br>
       &emsp;&emsp;&emsp;&emsp;MAX(price) AS Максимальная_цена,<br>
       &emsp;&emsp;&emsp;&emsp;AVG(price) AS Средняя_цена<br>
FROM book<br>
GROUP BY author;**

**Task 4.** Для каждого автора вычислить суммарную стоимость книг S (имя столбца Стоимость), а также вычислить налог на добавленную стоимость  для полученных сумм (имя столбца НДС ) , который включен в стоимость и составляет k = 18%,  а также стоимость книг  (Стоимость_без_НДС) без него. Значения округлить до двух знаков после запятой.

**SELECT author,<br>
       &emsp;&emsp;&emsp;&emsp;ROUND(SUM(price\*amount), 2) AS Стоимость,<br>
       &emsp;&emsp;&emsp;&emsp;ROUND((SUM(price\*amount) \* 0.18)/(1 + 0.18), 2) AS НДС,<br>
       &emsp;&emsp;&emsp;&emsp;ROUND(SUM(price\*amount)/(1 + 0.18), 2) AS Стоимость_без_НДС<br>
FROM book<br>
GROUP BY author;**

**Task 5.** Вывести цену самой дешевой книги, цену самой дорогой и среднюю цену уникальных книг на складе. Названия столбцов Минимальная_цена, Максимальная_цена, Средняя_цена соответственно. Среднюю цену округлить до двух знаков после запятой.

**SELECT MIN(price) AS Минимальная_цена,<br>
       &emsp;&emsp;&emsp;&emsp;MAX(price) AS Максимальная_цена,<br>
       &emsp;&emsp;&emsp;&emsp;ROUND(AVG(price), 2) AS Средняя_цена<br>
FROM book;**

**Task 6.** Вычислить среднюю цену и суммарную стоимость тех книг, количество экземпляров которых принадлежит интервалу от 5 до 14, включительно. Столбцы назвать Средняя_цена и Стоимость, значения округлить до 2-х знаков после запятой.

**SELECT ROUND(AVG(price), 2) AS Средняя_цена, SUM(amount\*price) AS Стоимость<br>
FROM book<br>
WHERE amount BETWEEN 5 and 14;**

**Task 7.** Посчитать стоимость всех экземпляров каждого автора без учета книг «Веселий цвинтар» и «Тигролови». В результат включить только тех авторов, у которых суммарная стоимость книг (без учета книг «Веселий цвинтар» и «Тигролови») более 5000 руб. Вычисляемый столбец назвать Стоимость. Результат отсортировать по убыванию стоимости.

**SELECT author, SUM(price * amount) AS Стоимость<br>
FROM book<br>
WHERE title NOT IN('Веселий цвинтар', 'Тигролови')<br>
GROUP BY author<br>
HAVING SUM(price * amount) > 5000<br>
ORDER BY Стоимость DESC;<br>**

## Section 1.4

**Task 1.** Вывести информацию (автора, название и цену) о  книгах, цены которых меньше или равны средней цене книг на складе. Информацию вывести в отсортированном по убыванию цены виде. Среднее вычислить как среднее по цене книги.

**SELECT author, title, price<br>
FROM book<br>
WHERE price <= (SELECT AVG(price)<br>
                &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book)<br>
ORDER BY price DESC;**

**Task 2.** Вывести информацию (автора, название и цену) о тех книгах, цены которых превышают минимальную цену книги на складе не более чем на 150 рублей в отсортированном по возрастанию цены виде.

**SELECT author, title, price<br>
FROM book<br>
WHERE ABS(price - (SELECT MIN(price) FROM book)) <= 150<br>
ORDER BY price;<br>**

**Task 3.** Вывести информацию (автора, книгу и количество) о тех книгах, количество экземпляров которых в таблице book не дублируется.

**SELECT author, title, amount<br>
FROM book<br>
WHERE amount NOT IN(SELECT amount<br>
                    &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book<br>
                    &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY amount<br>
                    &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;HAVING COUNT(amount) >= 2);**

**Task 4.** Вывести информацию о книгах(автор, название, цена), цена которых меньше самой большой из минимальных цен, вычисленных для каждого автора.

**SELECT author, title, price<br>
FROM book<br>
WHERE price < ANY(SELECT MIN(price)<br>
                   &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book<br>
                   &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY author);**

**Task 5.** Посчитать сколько и каких экземпляров книг нужно заказать поставщикам, чтобы на складе стало одинаковое количество экземпляров каждой книги, равное значению самого большего количества экземпляров одной книги на складе. Вывести название книги, ее автора, текущее количество экземпляров на складе и количество заказываемых экземпляров книг. Последнему столбцу присвоить имя Заказ. В результат не включать книги, которые заказывать не нужно.

**SELECT title, author, amount,<br>
&emsp;&emsp;&emsp;&emsp;ABS(amount - (SELECT MAX(amount) FROM book)) AS Заказ<br>
FROM book<br>
WHERE amount <> (SELECT MAX(amount) FROM book);**

## Section 1.5

**Task 1.** Создать таблицу поставка (supply), которая имеет ту же структуру, что и таблиц book.

**CREATE TABLE supply(<br>
    &emsp;&emsp;&emsp;&emsp;supply_id INT PRIMARY KEY AUTO_INCREMENT,<br>
    &emsp;&emsp;&emsp;&emsp;title VARCHAR(50),<br>
    &emsp;&emsp;&emsp;&emsp;author VARCHAR(30),<br>
    &emsp;&emsp;&emsp;&emsp;price DECIMAL(8, 2),<br>
    &emsp;&emsp;&emsp;&emsp;amount INT<br>
);**

**Task 2.** Занесите в таблицу supply четыре записи.

**INSERT INTO supply(title, author, price, amount)<br>
VALUES ('Веселий цвинтар', 'Стус В.С.', 518.99, 2),<br>
       &emsp;&emsp;&emsp;&emsp;('Листи до сина', 'Стус В.С.', 570.20, 6),<br>
       &emsp;&emsp;&emsp;&emsp;('Вибране: Поезії', 'Стус В.С.', 540.50, 7),<br>
       &emsp;&emsp;&emsp;&emsp;('Палімпсести', 'Стус В.С.', 360.80, 3);**

**Task 3.** Добавить из таблицы supply в таблицу book, все книги, кроме книг, написанных Хвильовим М.Г. и Багряним І.П.

**INSERT INTO book(title, author, price, amount)<br>
SELECT title, author, price, amount<br>
FROM supply<br>
WHERE author NOT IN('Багряний І.П.', 'Хвильовий М.Г.');**

**Task 4.** Занести из таблицы supply в таблицу book только те книги, авторов которых нет в  book.

**INSERT INTO book(title, author, price, amount)<br>
SELECT title, author, price, amount<br>
FROM supply<br>
WHERE author NOT IN(SELECT author<br>
                    &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book<br>
                    &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY author);**

**Task 5.** Уменьшить на 10% цену тех книг в таблице book, количество которых принадлежит интервалу от 5 до 10, включая границы.

**UPDATE book<br>
SET price = price * 0.9<br>
WHERE amount BETWEEN 5 AND 10;**

**Task 6.** В таблице book необходимо скорректировать значение для покупателя в столбце buy таким образом, чтобы оно не превышало количество экземпляров книг, указанных в столбце amount. А цену тех книг, которые покупатель не заказывал, снизить на 10%.

**UPDATE book<br>
SET buy = IF(buy > amount, amount, buy),<br>
    &emsp;&emsp;price = IF(buy = 0, price * 0.9, price);<br>**

**Task 7.** Для тех книг в таблице book , которые есть в таблице supply, не только увеличить их количество в таблице book ( увеличить их количество на значение столбца amountтаблицы supply), но и пересчитать их цену (для каждой книги найти сумму цен из таблиц book и supply и разделить на 2).

**UPDATE book, supply<br>
SET book.amount = book.amount + supply.amount,<br>
    &emsp;&emsp;book.price = (book.price + supply.price) / 2<br>
WHERE book.title = supply.title AND book.author = supply.author;**

**Task 8.** Удалить из таблицы supply книги тех авторов, общее количество экземпляров книг которых в таблице book превышает 10.

**DELETE FROM supply<br>
WHERE author IN (SELECT author<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY author<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;HAVING SUM(amount) > 10);**

**Task 9.** Создать таблицу заказ (ordering), куда включить авторов и названия тех книг, количество экземпляров которых в таблице book меньше среднего количества экземпляров книг в таблице book. В таблицу включить столбец   amount, в котором для всех книг указать одинаковое значение - среднее количество экземпляров книг в таблице book.

**CREATE TABLE ordering AS<br>
SELECT author, title, (SELECT AVG(amount) FROM book) AS amount<br>
FROM book<br>
WHERE amount < (SELECT AVG(amount)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book);**

## Section 1.6

**Task 1.** Вывести из таблицы trip информацию о командировках тех сотрудников, фамилия которых заканчивается на букву «а», в отсортированном по убыванию даты последнего дня командировки виде. В результат включить столбцы name, city, per_diem, date_first, date_last.

**SELECT name, city, per_diem, date_first, date_last<br>
FROM trip<br>
WHERE name LIKE '%а %'<br>
ORDER BY date_last DESC;**

**Task 2.** Вывести в алфавитном порядке фамилии и инициалы тех сотрудников, которые были в командировке в Киеве.

**SELECT name<br>
FROM trip<br>
WHERE city = 'Киев'<br>
GROUP BY name<br>
ORDER BY name;**

**Task 3.** Для каждого города посчитать, сколько раз сотрудники в нем были. Информацию вывести в отсортированном в алфавитном порядке по названию городов. Вычисляемый столбец назвать Количество. 

**SELECT city, COUNT(name) AS Количество<br>
FROM trip<br>
GROUP BY city<br>
ORDER BY city;**

**Task 4.** Вывести два города, в которых чаще всего были в командировках сотрудники. Вычисляемый столбец назвать Количество.

**SELECT city, COUNT(city) AS Количество<br>
FROM trip<br>
GROUP BY city<br>
ORDER BY Количество DESC<br>
LIMIT 2;**

**Task 5.** Вывести информацию о командировках во все города кроме Киева и Харькова (фамилии и инициалы сотрудников, город, длительность командировки в днях, при этом первый и последний день относится к периоду командировки). Последний столбец назвать Длительность. Информацию вывести в упорядоченном по убыванию длительности поездки, а потом по убыванию названий городов (в обратном алфавитном порядке).

**SELECT name, city, DATEDIFF(date_last, date_first) + 1 AS Длительность<br>
FROM trip<br>
WHERE city NOT IN ('Киев', 'Харьков')<br>
ORDER BY Длительность DESC, city DESC;**

**Task 6.** Вывести информацию о командировках сотрудника(ов), которые были самыми короткими по времени. В результат включить столбцы name, city, date_first, date_last.

**SELECT name, city, date_first, date_last<br>
FROM trip<br>
WHERE DATEDIFF(date_last, date_first) = (<br>
SELECT MIN(DATEDIFF(date_last, date_first))<br>
FROM trip<br>
);**

**Task 7.** Вывести информацию о командировках, начало и конец которых относятся к одному месяцу (год может быть любой). В результат включить столбцы name, city, date_first, date_last. Строки отсортировать сначала  в алфавитном порядке по названию города, а затем по фамилии сотрудника.

**SELECT name, city, date_first, date_last<br>
FROM trip<br>
WHERE MONTH(date_first) = MONTH(date_last)<br>
ORDER BY city, name;**

**Task 8.** Вывести название месяца и количество командировок для каждого месяца. Считаем, что командировка относится к некоторому месяцу, если она началась в этом месяце. Информацию вывести сначала в отсортированном по убыванию количества, а потом в алфавитном порядке по названию месяца виде. Название столбцов – Месяц и Количество.

**SELECT MONTHNAME(date_first) AS Месяц, COUNT(name) AS Количество<br>
FROM trip<br>
GROUP BY MONTHNAME(date_first)<br>
ORDER BY Количество DESC, Месяц;**

**Task 9.** Вывести сумму суточных (произведение количества дней командировки и размера суточных) для командировок, первый день которых пришелся на февраль или март 2020 года. Значение суточных для каждой командировки занесено в столбец per_diem. Вывести фамилию и инициалы сотрудника, город, первый день командировки и сумму суточных. Последний столбец назвать Сумма. Информацию отсортировать сначала  в алфавитном порядке по фамилиям сотрудников, а затем по убыванию суммы суточных.

**SELECT name, city, date_first,<br>
       &emsp;&emsp;&emsp;&emsp;(DATEDIFF(date_last, date_first) + 1) * per_diem AS Сумма<br>
FROM trip<br>
WHERE MONTH(date_first) IN (2, 3)<br>
ORDER BY name, Сумма DESC;**

**Task 10.** Вывести фамилию с инициалами и общую сумму суточных, полученных за все командировки для тех сотрудников, которые были в командировках больше чем 3 раза, в отсортированном по убыванию сумм суточных виде. Последний столбец назвать Сумма.

**SELECT name, SUM((DATEDIFF(date_last, date_first) + 1) * per_diem) AS Сумма<br>
FROM trip<br>
GROUP BY name<br>
HAVING COUNT(name) > 3<br>
ORDER BY Сумма DESC;**

## Section 1.7

**Task 1.** Создать таблицу fine.

**CREATE TABLE fine(<br>
    &emsp;&emsp;&emsp;&emsp;fine_id INT PRIMARY KEY AUTO_INCREMENT,<br>
    &emsp;&emsp;&emsp;&emsp;name VARCHAR(30),<br>
    &emsp;&emsp;&emsp;&emsp;number_plate VARCHAR(6),<br>
    &emsp;&emsp;&emsp;&emsp;violation VARCHAR(50),<br>
    &emsp;&emsp;&emsp;&emsp;sum_fine DECIMAL(8, 2),<br>
    &emsp;&emsp;&emsp;&emsp;date_violation DATE,<br>
    &emsp;&emsp;&emsp;&emsp;date_payment DATE<br>
&emsp;&emsp;&emsp;&emsp;);**

**Task 2.** В таблицу fine первые 5 строк уже занесены. Добавить в таблицу записи с ключевыми значениями 6, 7, 8.

**INSERT INTO fine(name, number_plate, violation, date_violation)<br>
VALUES ('Баранов П.Е.', 'Р523ВТ', 'Превышение скорости(от 40 до 60)', '2020-02-14'),<br>
       &emsp;&emsp;&emsp;&emsp;('Абрамова К.А.', 'О111АВ', 'Проезд на запрещающий сигнал', '2020-02-23'),<br>
       &emsp;&emsp;&emsp;&emsp;('Яковлев Г.Р.', 'Т330ТТ', 'Проезд на запрещающий сигнал', '2020-03-03');**<br>

**SELECT \* FROM fine;**

**Task 3.** Занести в таблицу fine суммы штрафов, которые должен оплатить водитель, в соответствии с данными из таблицы traffic_violation. При этом суммы заносить только в пустые поля столбца  sum_fine.

**UPDATE fine AS f, traffic_violation AS tv<br>
SET f.sum_fine = tv.sum_fine<br>
WHERE f.sum_fine IS NULL AND f.violation = tv.violation;**

**Task 4.** Вывести фамилию, номер машины и нарушение только для тех водителей, которые на одной машине нарушили одно и то же правило   два и более раз. При этом учитывать все нарушения, независимо от того оплачены они или нет. Информацию отсортировать в алфавитном порядке, сначала по фамилии водителя, потом по номеру машины и, наконец, по нарушению.

**SELECT name, number_plate, violation<br>
FROM fine<br>
GROUP BY name, number_plate, violation<br>
HAVING COUNT(name) >= 2<br>
ORDER BY name, number_plate, violation;**

**Task 5.** В таблице fine увеличить в два раза сумму неоплаченных штрафов для отобранных на предыдущем шаге записей.

**UPDATE fine AS f,<br>
&emsp;&emsp;&emsp;&emsp;(SELECT name, number_plate, violation<br>
&emsp;&emsp;&emsp;&emsp;FROM fine<br>
&emsp;&emsp;&emsp;&emsp;GROUP BY name, number_plate, violation<br>
&emsp;&emsp;&emsp;&emsp;HAVING COUNT(name) >= 2<br>
&emsp;&emsp;&emsp;&emsp;ORDER BY name, number_plate, violation) AS query_in**<br>

**SET f.sum_fine = f.sum_fine * 2<br>
WHERE f.name = query_in.name AND<br>
&emsp;&emsp;&emsp;&emsp;f.number_plate = query_in.number_plate AND<br>
&emsp;&emsp;&emsp;&emsp;f.violation = query_in.violation AND<br>
&emsp;&emsp;&emsp;&emsp;f.date_payment IS NULL;**<br>

**SELECT * FROM fine;**

**Task 6.** Водители оплачивают свои штрафы. В таблице payment занесены даты их оплаты. Необходимо:
1) в таблицу fine занести дату оплаты соответствующего штрафа из таблицы payment; 
2) уменьшить начисленный штраф в таблице fine в два раза  (только для тех штрафов, информация о которых занесена в таблицу payment) , если оплата произведена не позднее 20 дней со дня нарушения.

**UPDATE fine AS f, payment AS p<br>
SET f.date_payment = p.date_payment,<br>
    &emsp;&emsp;&emsp;&emsp;f.sum_fine = IF(DATEDIFF(f.date_payment, f.date_violation) <= 20, f.sum_fine / 2, f.sum_fine)**<br>

**WHERE f.name = p.name AND<br>
      &emsp;&emsp;&emsp;&emsp;f.number_plate = p.number_plate AND<br>
      &emsp;&emsp;&emsp;&emsp;f.violation = p.violation AND<br>
      &emsp;&emsp;&emsp;&emsp;f.date_violation = p.date_violation AND<br>
      &emsp;&emsp;&emsp;&emsp;f.date_payment IS NULL;**

**Task 7.** Создать новую таблицу back_payment, куда внести информацию о неоплаченных штрафах (Фамилию и инициалы водителя, номер машины, нарушение, сумму штрафа  и  дату нарушения) из таблицы fine.

**CREATE TABLE back_payment AS**<br>

**SELECT name, number_plate, violation, sum_fine, date_violation<br>
FROM fine<br>
WHERE date_payment IS NULL;**<br>

**SELECT * FROM back_payment;**

**Task 8.** Удалить из таблицы fine информацию о нарушениях, совершенных раньше 1 февраля 2020 года.

**DELETE FROM fine<br>
WHERE date_violation < '2020-02-01';**

# Section 2. Several tabels tasks

## Section 2.1

**Task 1.** Создать таблицу author.

**CREATE TABLE author(<br>
    &emsp;&emsp;&emsp;&emsp;author_id INT PRIMARY KEY AUTO_INCREMENT,<br>
    &emsp;&emsp;&emsp;&emsp;name_author VARCHAR(50)<br>
&emsp;&emsp;&emsp;&emsp;);**

**Task 2.** Заполнить таблицу author.

**INSERT INTO author(name_author)<br>
VALUES ('Франко І.Я.'),<br>
       &emsp;&emsp;&emsp;&emsp;('Шевченко Т.Г.'),<br>
       &emsp;&emsp;&emsp;&emsp;('Стус В.С.'),<br>
       &emsp;&emsp;&emsp;&emsp;('Багряний І.П.');**<br>

**SELECT * FROM author;**

**Task 3.** Перепишите запрос на создание таблицы book , чтобы ее структура соответствовала структуре, показанной на логической схеме (таблица genre уже создана, порядок следования столбцов - как на логической схеме в таблице book, genre_id  - внешний ключ) . Для genre_id ограничение о недопустимости пустых значений не задавать.

**CREATE TABLE book (<br>
    &emsp;&emsp;&emsp;&emsp;book_id INT PRIMARY KEY AUTO_INCREMENT,<br> 
    &emsp;&emsp;&emsp;&emsp;title VARCHAR(50),<br> 
    &emsp;&emsp;&emsp;&emsp;author_id INT NOT NULL,<br>
    &emsp;&emsp;&emsp;&emsp;genre_id INT,<br>
    &emsp;&emsp;&emsp;&emsp;price DECIMAL(8,2),<br> 
    &emsp;&emsp;&emsp;&emsp;amount INT,<br> 
    &emsp;&emsp;&emsp;&emsp;FOREIGN KEY (author_id)  REFERENCES author (author_id),<br>
    &emsp;&emsp;&emsp;&emsp;FOREIGN KEY (genre_id) REFERENCES genre (genre_id)<br>
&emsp;&emsp;&emsp;&emsp;);**

**Task 4.** Создать таблицу book той же структуры, что и на предыдущем шаге. Будем считать, что при удалении автора из таблицы author, должны удаляться все записи о книгах из таблицы book, написанные этим автором. А при удалении жанра из таблицы genre для соответствующей записи book установить значение Null в столбце genre_id.

**CREATE TABLE book (<br>
    &emsp;&emsp;&emsp;&emsp;book_id INT PRIMARY KEY AUTO_INCREMENT,<br> 
    &emsp;&emsp;&emsp;&emsp;title VARCHAR(50),<br> 
    &emsp;&emsp;&emsp;&emsp;author_id INT NOT NULL,<br>
    &emsp;&emsp;&emsp;&emsp;genre_id INT,<br>
    &emsp;&emsp;&emsp;&emsp;price DECIMAL(8,2),<br> 
    &emsp;&emsp;&emsp;&emsp;amount INT,<br> 
    &emsp;&emsp;&emsp;&emsp;FOREIGN KEY (author_id)  REFERENCES author (author_id) ON DELETE CASCADE,<br>
    &emsp;&emsp;&emsp;&emsp;FOREIGN KEY (genre_id) REFERENCES genre (genre_id) ON DELETE SET NULL<br>
&emsp;&emsp;&emsp;&emsp;);**

**Task 5.** Добавьте три последние записи (с ключевыми значениями 6, 7, 8) в таблицу book.

**INSERT INTO book(title, author_id, genre_id, price, amount)<br>
VALUES ('Вірши й поеми', 3, 2, 650.00, 15),<br>
       &emsp;&emsp;&emsp;&emsp;('Поеми', 3, 2, 570.20, 6),<br>
       &emsp;&emsp;&emsp;&emsp;('Лірика', 4, 2, 518.99, 2);**<br>
       
**SELECT * FROM book;**

## Section 2.2

**Task 1.** Вывести название, жанр и цену тех книг, количество которых больше 8, в отсортированном по убыванию цены виде.

**SELECT title, name_genre, price<br>
FROM<br>
    &emsp;&emsp;&emsp;genre INNER JOIN book<br>
    &emsp;&emsp;&emsp;ON genre.genre_id = book.genre_id<br>
WHERE amount > 8<br>
ORDER BY price DESC;**

**Task 2.** Вывести все жанры, которые не представлены в книгах на складе.

**SELECT name_genre<br>
FROM<br>
   &emsp;&emsp;&emsp;genre LEFT JOIN book<br>
   &emsp;&emsp;&emsp;ON genre.genre_id = book.genre_id<br>
   &emsp;&emsp;&emsp;WHERE title IS NULL;**

**Task 3.** Необходимо в каждом городе провести выставку книг каждого автора в течение 2020 года. Дату проведения выставки выбрать случайным образом. Создать запрос, который выведет город, автора и дату проведения выставки. Последний столбец назвать Дата. Информацию вывести, отсортировав сначала в алфавитном порядке по названиям городов, а потом по убыванию дат проведения выставок.

**SELECT name_city, name_author,<br>
       &emsp;&emsp;&emsp;DATE_ADD('2020-01-01', INTERVAL FLOOR(RAND() * 365) DAY) AS Дата<br>
FROM<br>
    &emsp;&emsp;&emsp;city CROSS JOIN author<br>
ORDER BY name_city, Дата DESC;**

**Task 4.** Вывести информацию о книгах (жанр, книга, автор), относящихся к жанру, включающему слово «роман» в отсортированном по названиям книг виде.

**SELECT name_genre, title, name_author<br>
FROM<br>
    &emsp;&emsp;&emsp;book<br>
    &emsp;&emsp;&emsp;INNER JOIN author ON book.author_id = author.author_id<br>
    &emsp;&emsp;&emsp;INNER JOIN genre ON book.genre_id = genre.genre_id<br>
WHERE name_genre = 'Роман'<br>
ORDER BY title;**

**Task 5.** Посчитать количество экземпляров  книг каждого автора из таблицы author.  Вывести тех авторов,  количество книг которых меньше 10, в отсортированном по возрастанию количества виде. Последний столбец назвать Количество.

**SELECT name_author,<br>
       &emsp;&emsp;&emsp;&emsp;SUM(amount) AS Количество<br>
FROM author LEFT JOIN book<br>
ON author.author_id = book.author_id<br>
GROUP BY name_author<br>
HAVING SUM(amount) < 10 OR SUM(amount) IS NULL<br>
ORDER BY Количество;**

**Task 6.** Вывести в алфавитном порядке всех авторов, которые пишут только в одном жанре.

**SELECT name_author<br>
FROM author INNER JOIN book<br>
ON author.author_id = book.author_id<br>
GROUP BY name_author<br>
HAVING COUNT(DISTINCT(genre_id)) = 1;**

**Task 7.** Вывести информацию о книгах (название книги, фамилию и инициалы автора, название жанра, цену и количество экземпляров книги), написанных в самых популярных жанрах, в отсортированном в алфавитном порядке по названию книг виде. Самым популярным считать жанр, общее количество экземпляров книг которого на складе максимально.

**SELECT title, name_author, name_genre, price, amount<br>
FROM<br>
    &emsp;&emsp;&emsp;book<br>
    &emsp;&emsp;&emsp;INNER JOIN author ON book.author_id = author.author_id<br>
    &emsp;&emsp;&emsp;INNER JOIN genre ON book.genre_id = genre.genre_id<br>
WHERE book.genre_id IN (SELECT subtable_1.genre_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;(SELECT genre_id, SUM(amount) AS sum_genre<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY genre_id) subtable_1<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;(SELECT genre_id, SUM(amount) AS sum_genre<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY genre_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;ORDER BY sum_genre DESC<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;LIMIT 1) subtable_2<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;ON subtable_1.sum_genre = subtable_2.sum_genre)<br>
ORDER BY title;**

**Task 8.** Если в таблицах supply  и book есть одинаковые книги, которые имеют равную цену,  вывести их название и автора, а также посчитать общее количество экземпляров книг в таблицах supply и book,  столбцы назвать Название, Автор  и Количество.

**SELECT book.title AS Название,<br>
       &emsp;&emsp;&emsp;&emsp;name_author AS Автор,<br>
       &emsp;&emsp;&emsp;&emsp;book.amount + supply.amount AS Количество<br>
FROM<br>
     &emsp;&emsp;&emsp;author<br>
     &emsp;&emsp;&emsp;INNER JOIN book USING (author_id)<br>
     &emsp;&emsp;&emsp;INNER JOIN supply ON author.name_author = supply.author<br>
WHERE book.title = supply.title AND<br>
      &emsp;&emsp;&emsp;&emsp;name_author = supply.author AND<br>
      &emsp;&emsp;&emsp;&emsp;book.price = supply.price;**

## Section 2.3

**Task 1.** Для книг, которые уже есть на складе (в таблице book), но по другой цене, чем в поставке (supply),  необходимо в таблице book увеличить количество на значение, указанное в поставке,  и пересчитать цену. А в таблице  supply обнулить количество этих книг.

**UPDATE book<br>
&emsp;&emsp;&emsp;&emsp;INNER JOIN supply ON supply.title = book.title<br>
&emsp;&emsp;&emsp;&emsp;INNER JOIN author ON book.author_id = author.author_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;AND supply.author = author.name_author<br>
SET book.amount = book.amount + supply.amount,<br>
&emsp;&emsp;book.price = (book.price * book.amount + supply.price * supply.amount) / (book.amount + supply.amount),<br>
&emsp;&emsp;supply.amount = 0<br>
WHERE book.price <> supply.price;**

**Task 2.** Включить новых авторов в таблицу author с помощью запроса на добавление, а затем вывести все данные из таблицы author.  Новыми считаются авторы, которые есть в таблице supply, но нет в таблице author.

**INSERT INTO author(name_author)<br>
SELECT supply.author<br>
FROM<br>
&emsp;&emsp;&emsp;author<br>
&emsp;&emsp;&emsp;RIGHT JOIN supply ON author.name_author = supply.author<br>
WHERE author.name_author IS NULL;**

**Task 3.** Добавить новые книги из таблицы supply в таблицу book на основе сформированного выше запроса. Затем вывести для просмотра таблицу book.

**INSERT INTO book(title, author_id, price, amount)<br>
SELECT title, author_id, price, amount<br>
FROM<br>
&emsp;&emsp;&emsp;author<br>
&emsp;&emsp;&emsp;INNER JOIN supply ON author.name_author = supply.author<br>
WHERE supply.amount <> 0;**

**Task 4.** Занести для книги «Вірші» Франка жанр «Поезія», а для книги «Тигролови» Багряного - «Пригоди». (Использовать два запроса).

**UPDATE book, genre<br>
SET book.genre_id = (SELECT genre_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM genre<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;WHERE name_genre = 'Поезія')<br>
WHERE book_id = 10;**<br>

**UPDATE book, genre<br>
SET book.genre_id = (SELECT genre_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM genre<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;WHERE name_genre = 'Пригоди')<br>
WHERE book_id = 11;**<br>

**SELECT * FROM book;**

**Task 5.** Удалить всех авторов и все их книги, общее количество книг которых меньше 20.

**DELETE FROM author<br>
WHERE author.author_id IN (SELECT author_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY author_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;HAVING SUM(amount) < 20);**

**Task 6.** Удалить все жанры, к которым относится меньше 4-х книг. В таблице book для этих жанров установить значение Null.

**DELETE FROM genre<br>
WHERE genre_id IN (SELECT book.genre_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM book<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY genre_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;HAVING COUNT(title) < 4);**

**Task 7.** Удалить всех авторов, которые пишут в жанре "Поезія". Из таблицы book удалить все книги этих авторов. В запросе для отбора авторов использовать полное название жанра, а не его id.

**DELETE FROM author<br>
USING book<br>
&emsp;&emsp;&emsp;&emsp;INNER JOIN genre ON book.genre_id = genre.genre_id<br>
&emsp;&emsp;&emsp;&emsp;INNER JOIN author ON book.author_id = author.author_id<br>
WHERE name_genre = 'Поезія';**

## Section 2.4

**Task 1.** Вывести все заказы Баранова Павла (id заказа, какие книги, по какой цене и в каком количестве он заказал) в отсортированном по номеру заказа и названиям книг виде.

**SELECT buy_book.buy_id, title, price, buy_book.amount<br>
FROM<br>
&emsp;&emsp;&emsp;client<br>
&emsp;&emsp;&emsp;INNER JOIN buy ON client.client_id = buy.client_id<br>
&emsp;&emsp;&emsp;INNER JOIN buy_book ON buy_book.buy_id = buy.buy_id<br>
&emsp;&emsp;&emsp;INNER JOIN book ON book.book_id = buy_book.book_id<br>
WHERE name_client = 'Баранов Павел'<br>
ORDER BY buy_book.buy_id, title;**

**Task 2.** Посчитать, сколько раз была заказана каждая книга, для книги вывести ее автора (нужно посчитать, в каком количестве заказов фигурирует каждая книга).  Вывести фамилию и инициалы автора, название книги, последний столбец назвать Количество. Результат отсортировать сначала  по фамилиям авторов, а потом по названиям книг.

**SELECT name_author, title, COUNT(buy_book.book_id) AS Количество<br>
FROM<br>
&emsp;&emsp;&emsp;author<br>
&emsp;&emsp;&emsp;INNER JOIN book ON author.author_id = book.author_id<br>
&emsp;&emsp;&emsp;LEFT JOIN buy_book ON book.book_id = buy_book.book_id<br>
GROUP BY title, name_author<br>
ORDER BY name_author, title;**

**Task 3.** Вывести города, в которых живут клиенты, оформлявшие заказы в интернет-магазине. Указать количество заказов в каждый город, этот столбец назвать Количество. Информацию вывести по убыванию количества заказов, а затем в алфавитном порядке по названию городов.

**SELECT name_city, COUNT(buy.client_id) AS Количество<br>
FROM<br>
&emsp;&emsp;&emsp;city<br>
&emsp;&emsp;&emsp;INNER JOIN client ON city.city_id = client.city_id<br>
&emsp;&emsp;&emsp;INNER JOIN buy ON client.client_id = buy.client_id<br>
GROUP BY name_city<br>
ORDER BY Количество DESC, name_city;**

**Task 4.** Вывести номера всех оплаченных заказов и даты, когда они были оплачены.

**SELECT buy_id, date_step_end<br>
FROM<br>
&emsp;&emsp;&emsp;step<br>
&emsp;&emsp;&emsp;INNER JOIN buy_step ON step.step_id = buy_step.step_id<br>
WHERE buy_step.step_id = 1 AND date_step_end IS NOT NULL;**

**Task 5.** Вывести информацию о каждом заказе: его номер, кто его сформировал (фамилия пользователя) и его стоимость (сумма произведений количества заказанных книг и их цены), в отсортированном по номеру заказа виде. Последний столбец назвать Стоимость.

**SELECT buy_book.buy_id, name_client, SUM(buy_book.amount * price) AS Стоимость<br>
FROM<br>
&emsp;&emsp;&emsp;book<br>
&emsp;&emsp;&emsp;INNER JOIN buy_book ON book.book_id = buy_book.book_id<br>
&emsp;&emsp;&emsp;INNER JOIN buy ON buy_book.buy_id = buy.buy_id<br>
&emsp;&emsp;&emsp;INNER JOIN client ON client.client_id = buy.client_id<br>
GROUP BY buy_book.buy_id, client.name_client<br>
ORDER BY buy_book.buy_id;**

**Task 6.** Вывести номера заказов (buy_id) и названия этапов,  на которых они в данный момент находятся. Если заказ доставлен –  информацию о нем не выводить. Информацию отсортировать по возрастанию buy_id.

**SELECT buy_id, name_step<br>
FROM<br>
&emsp;&emsp;&emsp;step<br>
&emsp;&emsp;&emsp;INNER JOIN buy_step ON step.step_id = buy_step.step_id<br>
WHERE date_step_beg IS NOT NULL AND<br>
&emsp;&emsp;&emsp;date_step_end IS NULL<br>
ORDER BY buy_id;**

**Task 7.** В таблице city для каждого города указано количество дней, за которые заказ может быть доставлен в этот город (рассматривается только этап Транспортировка). Для тех заказов, которые прошли этап транспортировки, вывести количество дней за которое заказ реально доставлен в город. А также, если заказ доставлен с опозданием, указать количество дней задержки, в противном случае вывести 0. В результат включить номер заказа (buy_id), а также вычисляемые столбцы Количество_дней и Опоздание. Информацию вывести в отсортированном по номеру заказа виде.

**SELECT buy.buy_id,<br>
&emsp;&emsp;DATEDIFF(date_step_end, date_step_beg) AS Количество_дней,<br>
&emsp;&emsp;IF(DATEDIFF(date_step_end, date_step_beg) < days_delivery, 0,<br>
&emsp;&emsp;&emsp;&emsp;ABS(DATEDIFF(date_step_end, date_step_beg) - days_delivery)) AS Опоздание**<br>

**FROM<br>
&emsp;&emsp;city<br>
&emsp;&emsp;INNER JOIN client ON city.city_id = client.city_id<br>
&emsp;&emsp;INNER JOIN buy ON client.client_id = buy.client_id<br>
&emsp;&emsp;INNER JOIN buy_step ON buy.buy_id = buy_step.buy_id<br>
&emsp;&emsp;INNER JOIN step ON buy_step.step_id = step.step_id**<br>
    
**WHERE date_step_beg IS NOT NULL AND<br>
&emsp;&emsp;&emsp;date_step_end IS NOT NULL AND<br>
&emsp;&emsp;&emsp;name_step = 'Транспортировка'**<br>

**ORDER BY buy.buy_id;**

**Task 8.** Выбрать всех клиентов, которые заказывали книги Шевченко, информацию вывести в отсортированном по алфавиту виде. В решении используйте фамилию автора, а не его id.

**SELECT name_client<br>
FROM<br>
&emsp;&emsp;&emsp;author<br>
&emsp;&emsp;&emsp;INNER JOIN book ON author.author_id = book.author_id<br>
&emsp;&emsp;&emsp;INNER JOIN buy_book ON buy_book.book_id = book.book_id<br>
&emsp;&emsp;&emsp;INNER JOIN buy ON buy.buy_id = buy_book.buy_id<br>
&emsp;&emsp;&emsp;INNER JOIN client ON buy.client_id = client.client_id<br>
WHERE name_author = 'Шевченко Т.Г.'<br>
GROUP BY name_client<br>
ORDER BY name_client;**

**Task 9.** Вывести жанр (или жанры), в котором было заказано больше всего экземпляров книг, указать это количество. Последний столбец назвать Количество.

**SELECT name_genre, SUM(buy_book.amount) AS Количество<br>
FROM<br>
&emsp;&emsp;&emsp;genre<br>
&emsp;&emsp;&emsp;INNER JOIN book ON genre.genre_id = book.genre_id<br>
&emsp;&emsp;&emsp;INNER JOIN buy_book ON buy_book.book_id = book.book_id<br>
GROUP BY name_genre<br>
HAVING SUM(buy_book.amount) = (SELECT SUM(buy_book.amount)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;genre<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN book ON genre.genre_id = book.genre_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN buy_book ON buy_book.book_id = book.book_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY name_genre<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;LIMIT 1);**

**Task 10.** Сравнить ежемесячную выручку от продажи книг за текущий и предыдущий годы. Для этого вывести год, месяц, сумму выручки в отсортированном сначала по возрастанию месяцев, затем по возрастанию лет виде. Название столбцов: Год, Месяц, Сумма.

**SELECT YEAR(date_payment) AS Год,<br>
&emsp;&emsp;&emsp;MONTHNAME(date_payment) AS Месяц,<br>
&emsp;&emsp;&emsp;SUM(price * amount) AS Сумма<br>
FROM<br>
&emsp;&emsp;buy_archive<br>
GROUP BY YEAR(date_payment), MONTHNAME(date_payment)<br>
UNION<br>
SELECT YEAR(date_step_end) AS Год,<br>
&emsp;&emsp;&emsp;MONTHNAME(date_step_end) AS Месяц,<br>
&emsp;&emsp;&emsp;SUM(buy_book.amount * book.price) AS Сумма<br>
FROM<br> 
&emsp;&emsp;book<br> 
&emsp;&emsp;INNER JOIN buy_book USING(book_id)<br>
&emsp;&emsp;INNER JOIN buy USING(buy_id)<br> 
&emsp;&emsp;INNER JOIN buy_step USING(buy_id)<br>
&emsp;&emsp;INNER JOIN step USING(step_id)<br>
WHERE date_step_end IS NOT Null and name_step = "Оплата"<br>
GROUP BY YEAR(date_step_end), MONTHNAME(date_step_end)<br>
ORDER BY Месяц, Год;**

**Task 11.** Для каждой отдельной книги необходимо вывести информацию о количестве проданных экземпляров и их стоимости за 2020 и 2019 год . Вычисляемые столбцы назвать Количество и Сумма. Информацию отсортировать по убыванию стоимости.

**SELECT title, SUM(Количество) AS Количество, SUM(Сумма) AS Сумма<br>
FROM    (SELECT title,<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;SUM(buy_archive.amount) AS Количество,<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;SUM(buy_archive.price * buy_archive.amount) AS Сумма<br>
&emsp;&emsp;&emsp;&emsp;FROM<br> 
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;buy_archive<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN book USING(book_id)<br>
&emsp;&emsp;&emsp;&emsp;GROUP BY title<br>
&emsp;&emsp;&emsp;&emsp;UNION ALL<br>
&emsp;&emsp;&emsp;&emsp;SELECT title,<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;SUM(buy_book.amount) AS Количество,<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;SUM(buy_book.amount * book.price) AS Сумма<br>
&emsp;&emsp;&emsp;&emsp;FROM<br> 
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;book<br> 
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN buy_book USING(book_id)<br> 
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN buy USING(buy_id)<br> 
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN buy_step USING(buy_id)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN step USING(step_id)<br>
&emsp;&emsp;&emsp;&emsp;WHERE date_step_end IS NOT Null and name_step = "Оплата"<br>
&emsp;&emsp;&emsp;&emsp;GROUP BY title) table_all<br>
GROUP BY title<br>
ORDER BY Сумма DESC;**

## Section 2.5

**Task 1.** Включить нового человека в таблицу с клиентами. Его имя Попов Илья, его email popov@test, проживает он в Киеве.

**INSERT INTO client(name_client, city_id, email)<br>
SELECT 'Попов Илья', city_id, 'popov@test'<br>
FROM city<br>
WHERE name_city = 'Киев';**

**Task 2.** Создать новый заказ для Попова Ильи. Его комментарий для заказа: «Связаться со мной по вопросу доставки».

**INSERT INTO buy(buy_description, client_id)<br>
SELECT 'Связаться со мной по вопросу доставки', client_id<br>
FROM client<br>
WHERE name_client = 'Попов Илья';**<br>

**SELECT * FROM buy;**

**Task 3.** В таблицу buy_book добавить заказ с номером 5. Этот заказ должен содержать книгу Франка «Лірика» в количестве двух экземпляров и книгу Багряний «Тигролови» в одном экземпляре.

**INSERT INTO buy_book(buy_id, book_id, amount)<br>
SELECT 5, book_id, 2<br>
FROM author INNER JOIN book USING(author_id)<br>
WHERE title = 'Лірика' AND name_author = 'Франко І.Я.';**<br>

**INSERT INTO buy_book(buy_id, book_id, amount)<br>
SELECT 5, book_id, 1<br>
FROM author INNER JOIN book USING(author_id)<br>
WHERE title = 'Тигролови' AND name_author = 'Багряний І.П.';**<br>

**SELECT * FROM buy_book;**

**Task 4.** Количество тех книг на складе, которые были включены в заказ с номером 5, уменьшить на то количество, которое в заказе с номером 5  указано.

**UPDATE book JOIN buy_book USING(book_id)<br>
SET book.amount = book.amount - buy_book.amount<br>
WHERE buy_book.buy_id = 5;**<br>

**SELECT * FROM book;**

**Task 5.** Создать счет (таблицу buy_pay) на оплату заказа с номером 5, в который включить название книг, их автора, цену, количество заказанных книг и  стоимость. Последний столбец назвать Стоимость. Информацию в таблицу занести в отсортированном по названиям книг виде.

**CREATE TABLE buy_pay AS<br>
SELECT title, name_author, price, buy_book.amount,<br>
&emsp;&emsp;&emsp;&emsp;(buy_book.amount * price) AS Стоимость<br>
FROM<br>
&emsp;&emsp;author<br>
&emsp;&emsp;INNER JOIN book USING(author_id)<br>
&emsp;&emsp;INNER JOIN buy_book USING(book_id)<br>
WHERE buy_id = 5<br>
ORDER BY title;**

**Task 6.** Создать общий счет (таблицу buy_pay) на оплату заказа с номером 5. Куда включить номер заказа, количество книг в заказе (название столбца Количество) и его общую стоимость (название столбца Итого). Для решения используйте ОДИН запрос.

**CREATE TABLE buy_pay AS<br>
SELECT buy_id, SUM(buy_book.amount) AS Количество,<br>
&emsp;&emsp;&emsp;&emsp;SUM(buy_book.amount * price) AS Итого<br>
FROM<br>
&emsp;&emsp;book<br>
&emsp;&emsp;INNER JOIN buy_book USING(book_id)<br>
WHERE buy_id = 5;**<br>

**SELECT * FROM buy_pay;**

**Task 7.** В таблицу buy_step для заказа с номером 5 включить все этапы из таблицы step, которые должен пройти этот заказ. В столбцы date_step_beg и date_step_end всех записей занести Null.

**INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end)**<br>

**SELECT client_id, step_id, NULL AS date_step_beg, NULL AS date_step_end<br>
FROM<br>
&emsp;&emsp;buy<br>
&emsp;&emsp;CROSS JOIN step<br>
WHERE buy_id = 5;**

**Task 8.** В таблицу buy_step занести дату 12.04.2020 выставления счета на оплату заказа с номером 5.

**UPDATE buy_step
SET date_step_beg = '2020-04-12'**

**WHERE buy_id = 5 AND step_id = 1;**

**Task 9.** Завершить этап «Оплата» для заказа с номером 5, вставив в столбец date_step_end дату 13.04.2020, и начать следующий этап («Упаковка»), задав в столбце date_step_beg для этого этапа ту же дату.

Реализовать два запроса для завершения этапа и начале следующего. Они должны быть записаны в общем виде, чтобы его можно было применять для любых этапов, изменив только текущий этап. Для примера пусть это будет этап «Оплата».

**UPDATE buy_step<br>
SET date_step_end = IF(date_step_beg IS NOT NULL AND date_step_end IS NULL, '2020-04-13', date_step_end),<br>
&emsp;&emsp;date_step_beg = IF(step_id=2, '2020-04-13', date_step_beg)<br>
WHERE buy_id = 5;**<br>

**SELECT \*<br>
FROM buy_step<br>
WHERE buy_id = 5;**

# Section 3. Data bases

## Section 3.1

**Task 1.** Вывести студентов, которые сдавали дисциплину «Основы баз данных», указать дату попытки и результат. Информацию вывести по убыванию результатов тестирования.

**SELECT name_student, date_attempt, result<br>
FROM<br>
&emsp;&emsp;&emsp;subject<br>
&emsp;&emsp;&emsp;INNER JOIN attempt USING(subject_id)<br>
&emsp;&emsp;&emsp;INNER JOIN student USING(student_id)<br>
WHERE name_subject = 'Основы баз данных'<br>
ORDER BY result DESC;**

**Task 2.** Вывести, сколько попыток сделали студенты по каждой дисциплине, а также средний результат попыток, который округлить до 2 знаков после запятой. Под результатом попытки понимается процент правильных ответов на вопросы теста, который занесен в столбец result.  В результат включить название дисциплины, а также вычисляемые столбцы Количество и Среднее. Информацию вывести по убыванию средних результатов.

**SELECT name_subject,<br>
&emsp;&emsp;&emsp;&emsp;COUNT(date_attempt) AS Количество,<br>
&emsp;&emsp;&emsp;&emsp;ROUND(AVG(result), 2) AS Среднее<br>
FROM<br>
&emsp;&emsp;&emsp;subject<br>
&emsp;&emsp;&emsp;LEFT JOIN attempt ON subject.subject_id = attempt.subject_id<br>
GROUP BY name_subject<br>
ORDER BY Среднее DESC;**

**Task 3.** Вывести студентов (различных студентов), имеющих максимальные результаты попыток . Информацию отсортировать в алфавитном порядке по фамилии студента.

**SELECT name_student, result<br>
FROM<br>
&emsp;&emsp;&emsp;student<br>
&emsp;&emsp;&emsp;LEFT JOIN attempt ON student.student_id = attempt.student_id<br>
WHERE result = (SELECT MAX(result)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM attempt)<br>
ORDER BY name_student;**

**Task 4.** Если студент совершал несколько попыток по одной и той же дисциплине, то вывести разницу в днях между первой и последней попыткой. В результат включить фамилию и имя студента, название дисциплины и вычисляемый столбец Интервал. Информацию вывести по возрастанию разницы. Студентов, сделавших одну попытку по дисциплине, не учитывать.

**SELECT name_student, name_subject, DATEDIFF(MAX(date_attempt), MIN(date_attempt)) AS Интервал<br>
FROM<br>
&emsp;&emsp;&emsp;subject<br>
&emsp;&emsp;&emsp;INNER JOIN attempt USING(subject_id)<br>
&emsp;&emsp;&emsp;INNER JOIN student USING(student_id)<br>
GROUP BY name_student, name_subject<br>
HAVING COUNT(date_attempt) > 1<br>
ORDER BY Интервал;**

**Task 5.** Студенты могут тестироваться по одной или нескольким дисциплинам (не обязательно по всем). Вывести дисциплину и количество уникальных студентов (столбец назвать Количество), которые по ней проходили тестирование . Информацию отсортировать сначала по убыванию количества, а потом по названию дисциплины. В результат включить и дисциплины, тестирование по которым студенты не проходили, в этом случае указать количество студентов 0.

**SELECT name_subject,<br>
&emsp;&emsp;&emsp;&emsp;COUNT(DISTINCT(student_id)) AS Количество<br>
FROM<br>
&emsp;&emsp;&emsp;subject<br>
&emsp;&emsp;&emsp;LEFT JOIN attempt USING(subject_id)<br>
GROUP BY name_subject<br>
ORDER BY Количество DESC, name_subject;**

**Task 6.** Случайным образом отберите 3 вопроса по дисциплине «Основы баз данных». В результат включите столбцы question_id и name_question.

**SELECT question_id, name_question<br>
FROM<br>
&emsp;&emsp;&emsp;subject<br>
&emsp;&emsp;&emsp;INNER JOIN question USING(subject_id)<br>
WHERE name_subject = 'Основы баз данных'<br>
ORDER BY RAND()<br>
LIMIT 3;**

**Task 7.** Вывести вопросы, которые были включены в тест для Семенова Ивана по дисциплине «Основы SQL» 2020-05-17  (значение attempt_id для этой попытки равно 7). Указать, какой ответ дал студент и правильный он или нет(вывести Верно или Неверно). В результат включить вопрос, ответ и вычисляемый столбец  Результат.

**SELECT name_question, name_answer,<br>
&emsp;&emsp;&emsp;&emsp;IF(is_correct = 0, 'Неверно', 'Верно') AS Результат<br>
FROM<br>
&emsp;&emsp;&emsp;answer<br>
&emsp;&emsp;&emsp;INNER JOIN testing ON answer.answer_id = testing.answer_id<br>
&emsp;&emsp;&emsp;INNER JOIN question ON question.question_id = testing.question_id<br>
WHERE attempt_id = 7;**

**Task 8.** Посчитать результаты тестирования. Результат попытки вычислить как количество правильных ответов, деленное на 3 (количество вопросов в каждой попытке) и умноженное на 100. Результат округлить до двух знаков после запятой. Вывести фамилию студента, название предмета, дату и результат. Последний столбец назвать Результат. Информацию отсортировать сначала по фамилии студента, потом по убыванию даты попытки.

**SELECT name_student, name_subject, date_attempt, ROUND(SUM(is_correct/3\*100), 2) AS Результат<br>
FROM<br>
&emsp;&emsp;&emsp;answer<br>
&emsp;&emsp;&emsp;JOIN testing USING(answer_id)<br>
&emsp;&emsp;&emsp;JOIN attempt USING(attempt_id)<br>
&emsp;&emsp;&emsp;JOIN subject USING(subject_id)<br>
&emsp;&emsp;&emsp;JOIN student USING(student_id)<br>
GROUP BY name_student, name_subject, date_attempt<br>
ORDER BY name_student, date_attempt DESC;**

**Task 9.** Для каждого вопроса вывести процент успешных решений, то есть отношение количества верных ответов к общему количеству ответов, значение округлить до 2-х знаков после запятой. Также вывести название предмета, к которому относится вопрос, и общее количество ответов на этот вопрос. В результат включить название дисциплины, вопросы по ней (столбец назвать Вопрос), а также два вычисляемых столбца Всего_ответов и Успешность. Информацию отсортировать сначала по названию дисциплины, потом по убыванию успешности, а потом по тексту вопроса в алфавитном порядке.

Поскольку тексты вопросов могут быть длинными, обрезать их 30 символов и добавить многоточие "...".

**SELECT name_subject, CONCAT(LEFT(name_question, 30), '...') AS Вопрос,<br>
&emsp;&emsp;&emsp;&emsp;COUNT(is_correct) AS Всего_ответов,<br>
&emsp;&emsp;&emsp;&emsp;ROUND((SUM(is_correct) / COUNT(is_correct)) * 100, 2) AS Успешность<br>
FROM<br>
&emsp;&emsp;&emsp;subject<br>
&emsp;&emsp;&emsp;INNER JOIN question ON subject.subject_id = question.subject_id<br>
&emsp;&emsp;&emsp;INNER JOIN testing ON testing.question_id = question.question_id<br>
&emsp;&emsp;&emsp;LEFT JOIN answer ON answer.answer_id = testing.answer_id<br>
GROUP BY name_subject, name_question<br>
ORDER BY name_subject, Успешность DESC, Вопрос;**

## Section 3.2

**Task 1.** В таблицу attempt включить новую попытку для студента Баранова Павла по дисциплине «Основы баз данных». Установить текущую дату в качестве даты выполнения попытки.

**INSERT INTO attempt(student_id, subject_id, date_attempt, result)<br>
SELECT<br>
&emsp;&emsp;&emsp;&emsp;(SELECT student_id FROM student WHERE name_student = 'Баранов Павел'),<br>
&emsp;&emsp;&emsp;&emsp;(SELECT subject_id FROM subject WHERE name_subject = 'Основы баз данных'),<br>
&emsp;&emsp;&emsp;&emsp;NOW(),<br>
&emsp;&emsp;&emsp;&emsp;NULL;**<br>

**SELECT * FROM attempt;**

**Task 2.** Случайным образом выбрать три вопроса (запрос) по дисциплине, тестирование по которой собирается проходить студент, занесенный в таблицу attempt последним, и добавить их в таблицу testing.id последней попытки получить как максимальное значение id из таблицы attempt.

**INSERT INTO testing(attempt_id, question_id)<br>
SELECT attempt_id, question_id<br>
FROM<br>
&emsp;&emsp;&emsp;attempt<br>
&emsp;&emsp;&emsp;INNER JOIN question ON attempt.subject_id = question.subject_id<br>
WHERE attempt_id = (SELECT MAX(attempt_id)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM attempt)<br>
ORDER BY RAND()<br>
LIMIT 3;**

**Task 3.** Студент прошел тестирование (то есть все его ответы занесены в таблицу testing), далее необходимо вычислить результат(запрос) и занести его в таблицу attempt для соответствующей попытки.  Результат попытки вычислить как количество правильных ответов, деленное на 3 (количество вопросов в каждой попытке) и умноженное на 100. Результат округлить до целого.
Будем считать, что мы знаем id попытки,  для которой вычисляется результат, в нашем случае это 8.

**UPDATE attempt<br>
SET result = (SELECT ROUND(SUM(is_correct/3\*100), 2)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM answer<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN testing ON answer.answer_id = testing.answer_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;WHERE attempt_id = 8)<br>
WHERE attempt_id = 8;**<br>

**SELECT * FROM attempt;**

**Task 4.** Удалить из таблицы attempt все попытки, выполненные раньше 1 мая 2020 года. Также удалить и все соответствующие этим попыткам вопросы из таблицы testing.

**DELETE FROM attempt<br>
WHERE date_attempt < '2020-05-01';**<br>

**SELECT * FROM attempt;**

## Section 3.3

**Task 1.** Вывести абитуриентов, которые хотят поступать на образовательную программу «Мехатроника и робототехника» в отсортированном по фамилиям виде.

**SELECT name_enrollee<br>
FROM enrollee<br>
&emsp;&emsp;&emsp;&emsp;JOIN program_enrollee ON enrollee.enrollee_id = program_enrollee.enrollee_id<br>
&emsp;&emsp;&emsp;&emsp;JOIN program ON program.program_id = program_enrollee.program_id<br>
WHERE name_program LIKE 'Мехатроника и робототехника'<br>
ORDER BY name_enrollee**

**Task 2.** Вывести образовательные программы, на которые для поступления необходим предмет «Информатика». Программы отсортировать в обратном алфавитном порядке.

**SELECT name_program<br>
FROM<br>
&emsp;&emsp;&emsp;subject<br>
&emsp;&emsp;&emsp;INNER JOIN program_subject ON subject.subject_id = program_subject.subject_id<br>
&emsp;&emsp;&emsp;INNER JOIN program ON program.program_id = program_subject.program_id<br>
WHERE name_subject = 'Информатика'<br>
ORDER BY name_program DESC;**

**Task 3.** Выведите количество абитуриентов, сдавших ЗНО по каждому предмету, максимальное, минимальное и среднее значение баллов по предмету ЗНО. Вычисляемые столбцы назвать Количество, Максимум, Минимум, Среднее. Информацию отсортировать по названию предмета в алфавитном порядке, среднее значение округлить до одного знака после запятой.

**SELECT name_subject,<br>
&emsp;&emsp;&emsp;&emsp;COUNT(name_subject) AS Количество,<br>
&emsp;&emsp;&emsp;&emsp;MAX(result) AS Максимум,<br>
&emsp;&emsp;&emsp;&emsp;MIN(result) AS Минимум,<br>
&emsp;&emsp;&emsp;&emsp;ROUND(AVG(result), 1) AS Среднее<br>
FROM<br>
&emsp;&emsp;subject<br>
&emsp;&emsp;INNER JOIN enrollee_subject ON subject.subject_id = enrollee_subject.subject_id<br>
GROUP BY name_subject<br>
ORDER BY name_subject;**

**Task 4.** Вывести образовательные программы, для которых минимальный балл ЗНО по каждому предмету больше или равен 40 баллам. Программы вывести в отсортированном по алфавиту виде.

**SELECT name_program<br>
FROM<br>
&emsp;&emsp;&emsp;program<br>
&emsp;&emsp;&emsp;INNER JOIN program_subject ON program.program_id = program_subject.program_id<br>
GROUP BY name_program<br>
HAVING MIN(min_result) >= 40<br>
ORDER BY name_program;**

**Task 5.** Вывести образовательные программы, которые имеют самый большой план набора,  вместе с этой величиной.

**SELECT name_program, plan<br>
FROM program<br>
WHERE plan = (SELECT MAX(plan)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM program);**

**Task 6.** Посчитать, сколько дополнительных баллов получит каждый абитуриент. Столбец с дополнительными баллами назвать Бонус. Информацию вывести в отсортированном по фамилиям виде.

**SELECT name_enrollee, IF(SUM(bonus) IS NULL, 0, SUM(bonus)) AS Бонус<br>
FROM<br>
&emsp;&emsp;&emsp;enrollee<br>
&emsp;&emsp;&emsp;LEFT JOIN enrollee_achievement ON enrollee.enrollee_id = enrollee_achievement.enrollee_id<br>
&emsp;&emsp;&emsp;LEFT JOIN achievement ON enrollee_achievement.achievement_id = achievement.achievement_id<br>
GROUP BY name_enrollee<br>
ORDER BY name_enrollee;**

**Task 7.** Выведите сколько человек подало заявление на каждую образовательную программу и конкурс на нее (число поданных заявлений деленное на количество мест по плану), округленный до 2-х знаков после запятой. В запросе вывести название факультета, к которому относится образовательная программа, название образовательной программы, план набора абитуриентов на образовательную программу (plan), количество поданных заявлений (Количество) и Конкурс. Информацию отсортировать в порядке убывания конкурса.

**SELECT name_department, name_program, plan,<br>
&emsp;&emsp;&emsp;&emsp;COUNT(program_enrollee.program_id) AS Количество,<br>
&emsp;&emsp;&emsp;&emsp;ROUND(COUNT(program_enrollee.program_id) / plan, 2) AS Конкурс<br>
FROM<br>
&emsp;&emsp;&emsp;department<br>
&emsp;&emsp;&emsp;INNER JOIN program ON department.department_id = program.department_id<br>
&emsp;&emsp;&emsp;INNER JOIN program_enrollee ON program.program_id = program_enrollee.program_id<br>
GROUP BY name_department, name_program, plan<br>
ORDER BY Конкурс DESC;**

**Task 8.** Вывести образовательные программы, на которые для поступления необходимы предмет «Информатика» и «Математика» в отсортированном по названию программ виде.

**SELECT name_program<br>
FROM program<br>
&emsp;&emsp;&emsp;INNER JOIN program_subject ON program.program_id = program_subject.program_id<br>
&emsp;&emsp;&emsp;INNER JOIN subject ON subject.subject_id = program_subject.subject_id<br>
WHERE name_subject IN ("Информатика", "Математика")<br>
GROUP BY name_program<br>
HAVING COUNT(name_subject) = 2<br>
ORDER BY name_program;**

**Task 9.** Посчитать количество баллов каждого абитуриента на каждую образовательную программу, на которую он подал заявление, по результатам ЗНО. В результат включить название образовательной программы, фамилию и имя абитуриента, а также столбец с суммой баллов, который назвать itog. Информацию вывести в отсортированном сначала по образовательной программе, а потом по убыванию суммы баллов виде.

**SELECT name_program, name_enrollee, SUM(result) AS itog<br>
FROM<br>
&emsp;&emsp;&emsp;enrollee<br>
&emsp;&emsp;&emsp;INNER JOIN program_enrollee USING(enrollee_id)<br>
&emsp;&emsp;&emsp;INNER JOIN program USING(program_id)<br>
&emsp;&emsp;&emsp;INNER JOIN program_subject USING(program_id)<br>
&emsp;&emsp;&emsp;INNER JOIN enrollee_subject USING(subject_id,enrollee_id)<br>
GROUP BY name_program, name_enrollee<br>
ORDER BY name_program, itog DESC;**

**Task 10.** Вывести название образовательной программы и фамилию тех абитуриентов, которые подавали документы на эту образовательную программу, но не могут быть зачислены на нее. Эти абитуриенты имеют результат по одному или нескольким предметам ЗНО, необходимым для поступления на эту образовательную программу, меньше минимального балла. Информацию вывести в отсортированном сначала по программам, а потом по фамилиям абитуриентов виде.

Например, Баранов Павел по «Физике» набрал 41 балл, а  для образовательной программы «Прикладная механика» минимальный балл по этому предмету определен в 45 баллов. Следовательно, абитуриент на данную программу не может поступить.

**SELECT name_program, name_enrollee<br>
FROM<br>
&emsp;&emsp;&emsp;enrollee<br>
&emsp;&emsp;&emsp;INNER JOIN program_enrollee USING(enrollee_id)<br>
&emsp;&emsp;&emsp;INNER JOIN program USING(program_id)<br>
&emsp;&emsp;&emsp;INNER JOIN program_subject USING(program_id)<br>
&emsp;&emsp;&emsp;INNER JOIN enrollee_subject USING(subject_id,enrollee_id)<br>
WHERE result < min_result<br>
GROUP BY name_program, name_enrollee<br>
ORDER BY name_program, name_enrollee;**

## Section 3.4

**Step 1.** Создать вспомогательную таблицу applicant,  куда включить id образовательной программы, id абитуриента, сумму баллов абитуриентов (столбец itog) в отсортированном сначала по id образовательной программы, а потом по убыванию суммы баллов виде (использовать запрос из предыдущего урока).

**CREATE TABLE applicant AS<br>
SELECT program_id, enrollee_id, SUM(result) AS itog<br>
FROM<br>
&emsp;&emsp;&emsp;enrollee<br>
&emsp;&emsp;&emsp;INNER JOIN program_enrollee USING(enrollee_id)<br>
&emsp;&emsp;&emsp;INNER JOIN program USING(program_id)<br>
&emsp;&emsp;&emsp;INNER JOIN program_subject USING(program_id)<br>
&emsp;&emsp;&emsp;INNER JOIN enrollee_subject USING(subject_id,enrollee_id)<br>
GROUP BY program_id, enrollee_id<br>
ORDER BY program_id, itog DESC;**

**Step 2.** Из таблицы applicant, созданной на предыдущем шаге, удалить записи, если абитуриент на выбранную образовательную программу не набрал минимального балла хотя бы по одному предмету (использовать запрос из предыдущего урока).

**DELETE FROM applicant<br>
WHERE (program_id, enrollee_id) IN (SELECT program_id, enrollee_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;enrollee<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN program_enrollee USING(enrollee_id)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN program USING(program_id)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN program_subject USING(program_id)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;INNER JOIN enrollee_subject USING(subject_id,enrollee_id)<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;WHERE result < min_result<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY program_id, enrollee_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;ORDER BY program_id, enrollee_id);**

**Step 3.** Повысить итоговые баллы абитуриентов в таблице applicant на значения дополнительных баллов (использовать запрос из предыдущего урока).

**UPDATE applicant<br>
&emsp;&emsp;&emsp;&emsp;INNER JOIN (SELECT enrollee.enrollee_id, IF(SUM(bonus) IS NULL, 0, SUM(bonus)) AS points<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;FROM<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;enrollee<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;LEFT JOIN enrollee_achievement ON enrollee.enrollee_id =<br> enrollee_achievement.enrollee_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;LEFT JOIN achievement ON enrollee_achievement.achievement_id =<br> achievement.achievement_id<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;GROUP BY enrollee.enrollee_id) AS extra USING(enrollee_id)<br>
SET itog = itog + points;**<br>

**SELECT * FROM applicant;**

**Step 4.** Поскольку при добавлении дополнительных баллов, абитуриенты по каждой образовательной программе могут следовать не в порядке убывания суммарных баллов, необходимо создать новую таблицу applicant_order на основе таблицы applicant. При создании таблицы данные нужно отсортировать сначала по id образовательной программы, потом по убыванию итогового балла. А таблицу applicant, которая была создана как вспомогательная, необходимо удалить.

**CREATE TABLE applicant_order AS<br>
SELECT \*<br>
FROM applicant<br>
ORDER BY program_id, itog DESC;**<br>

**DROP TABLE applicant;**

**Step 5.** Включить в таблицу applicant_order новый столбец str_id целого типа , расположить его перед первым.

**ALTER TABLE applicant_order ADD str_id INT FIRST;**

**Step 6.** Занести в столбец str_id таблицы applicant_order нумерацию абитуриентов, которая начинается с 1 для каждой образовательной программы.

**SET @num_pr := 0;<br>
SET @row_num := 1;**<br>

**UPDATE applicant_order<br>
SET str_id = IF(program_id = @num_pr, @row_num := @row_num + 1,<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;@row_num := 1 AND @num_pr := @num_pr + 1);**<br>

**SELECT *<br>
FROM applicant_order;**

**Step 7.** Создать таблицу student,  в которую включить абитуриентов, которые могут быть рекомендованы к зачислению  в соответствии с планом набора. Информацию отсортировать сначала в алфавитном порядке по названию программ, а потом по убыванию итогового балла.

**CREATE TABLE student AS<br>
SELECT name_program, name_enrollee, itog<br>
FROM enrollee<br>
&emsp;&emsp;&emsp;INNER JOIN applicant_order ON enrollee.enrollee_id = applicant_order.enrollee_id<br>
&emsp;&emsp;&emsp;INNER JOIN program ON applicant_order.program_id = program.program_id<br>
WHERE str_id <= plan<br>
GROUP BY name_program, name_enrollee, itog<br>
ORDER BY name_program, itog DESC;**<br>

**SELECT * FROM student;**